Repository: sei-international/leap-weap-integration
Catalog: locale/*/LC_MESSAGES/wave_integration.po
Languages: ru_ru

source: The expression for {b}:{v} is not an Interp() expression: Cannot update with data from LEAP. Exiting...
ru_ru: Выражение для {b}:{v} не является выражением Interp(): Невозможно обновить данные из LEAP. Выход...

source: Unrecognized month "{m}" in month_num function. Exiting...
ru_ru: Нераспознанный месяц "{m}" в функции month_num. Выход...

source: The active {a} area does not contain the required variable {b}:{v} with unit {v}. Please check the area and try again. Exiting...
ru_ru: Активная область {a} не содержит требуемой переменной {b}:{v} с единицей измерения {v}. Пожалуйста, проверьте область и повторите попытку. Выход...

source: Could not enable calculations for region {r} in the active LEAP area. Please check the area and try again. Exiting...
ru_ru: Не удалось включить расчеты для региона {r} в активной области LEAP. Пожалуйста, проверьте область и повторите попытку. Выход...

source: The Windows list separator is longer than 1 character, which is incompatible with the WEAP-LEAP integration procedure. Exiting...
ru_ru: Разделитель списка Windows длиннее 1 символа, что несовместимо с процедурой интеграции WEAP-LEAP. Выход...

source: WAVE integration: Cannot start LEAP and WEAP. Exiting...
ru_ru: Интеграция WAVE: Невозможно запустить LEAP и WEAP. Выход...

source: WEAP-LEAP Integration Procedure
ru_ru: Процедура интеграции WEAP-LEAP

source: Initiating integration procedure...
ru_ru: Инициирование процедуры интеграции...

source: Could not locate the Julia executable. Try adding the path to the executable to the Windows PATH environment variable.
ru_ru: Не удалось найти исполняемый файл Julia. Попробуйте добавить путь к исполняемому файлу в переменную окружения Windows PATH.

source: Open LEAP Area
ru_ru: Открытая зона LEAP

source: Please open the WAVE model (area) in LEAP (the same as defined in config.yml) and select the scenarios and years you would like to run.
ru_ru: Пожалуйста, откройте модель (область) WAVE в LEAP (такую же, как определена в config.yml) и выберите сценарии и годы, которые вы хотели бы запустить.

source: NOTE: LEAP settings determine calculated scenarios. Scenario selection in WEAP will be overwritten.
ru_ru: ПРИМЕЧАНИЕ: Настройки LEAP определяют рассчитанные сценарии. Выбор сценария в WEAP будет переписан.

source: Request to open WAVE model area in LEAP declined. Exiting...
ru_ru: Запрос на открытие области модели WAVE в LEAP отклонен. Выход...

source: Validating WEAP and LEAP areas
ru_ru: Валидирование областей WEAP и LEAP

source: Validating branches in WEAP and LEAP
ru_ru: Проверка ветвей в WEAP и LEAP

source: Running the model for regions:
ru_ru: Запуск модели для регионов:

source: Including LEAP hydropower plants:
ru_ru: Включая гидроэлектростанции LEAP:

source: Including WEAP hydropower reservoirs:
ru_ru: Включая гидроэнергетические водохранилища WEAP:

source: Identifying scenarios to calculate
ru_ru: Определение сценариев для расчета

source: At least one scenario must be calculated in the active {a} area. Exiting...
ru_ru: В активной области {a} должен быть рассчитан хотя бы один сценарий. Выход...

source: Could not find scenarios in the active {a2} area corresponding to the scenarios calculated in the active {a1} area. Exiting...
ru_ru: Не удалось найти сценарии в активной области {a2}, соответствующие сценариям, рассчитанным в активной области {a1}. Выход...

source: Unsupported application: "{a}". Exiting...
ru_ru: Неподдерживаемое приложение: "{a}". Выход...

source: Calculating the following scenarios:
ru_ru: Расчет следующих сценариев:

source: Clearing hydropower reservoir energy demand from WEAP scenarios to avoid forcing model with results from past integration runs.
ru_ru: Очистка спроса на энергию гидроэнергетических водохранилищ от сценариев WEAP, чтобы не заставлять модель использовать результаты прошлых интеграционных прогонов.

source: Running LEAP-Macro for scenario: {s}
ru_ru: Запуск LEAP-Macro для сценария: {s}

source: Region: {r}
ru_ru: Регион: {r}

source: Executing: {e}
ru_ru: Выполняется: {e}

source: LEAP-Macro exited with an error
ru_ru: LEAP-Macro завершился с ошибкой

source: Moving demographic and macroeconomic assumptions from LEAP to WEAP (iteration {i})
ru_ru: Перемещение демографических и макроэкономических предположений из LEAP в WEAP (итерация {i})

source: Pushing demographic and macroeconomic drivers from LEAP to WEAP
ru_ru: Перемещение демографических и макроэкономических факторов из LEAP в WEAP

source: Unit multiplier for variable "{v}" is unknown. Exiting...
ru_ru: Множитель единицы для переменной "{v}" неизвестен. Выход...

source: Pushed {n} variable(s) to WEAP
ru_ru: Передано {n} переменной(ых) в WEAP

source: Calculating WEAP (iteration {i})
ru_ru: Вычисление WEAP (итерация {i})

source: Finished calculating WEAP. Moving hydropower maximum availabilities from WEAP to LEAP....
ru_ru: Закончен расчет WEAP. Перемещение максимальных возможностей гидроэнергетики из WEAP в LEAP....

source: Moving hydropower availability from WEAP to LEAP (iteration {i})
ru_ru: Перемещение доступности гидроэнергетики из WEAP в LEAP (итерация {i})

source: WEAP scenario: {s}
ru_ru: Сценарий WEAP: {s}

source: WEAP hydropower reservoir: {r}
ru_ru: Водохранилище гидроэлектростанции WEAP: {r}

source: Energy Generation in WEAP has to be in Gigajoules. Exiting...
ru_ru: Выработка энергии в WEAP должна быть в гигаджоулях. Выход...

source: Energy generation in WEAP is not monthly or not available for every simulation month. Exiting...
ru_ru: Выработка энергии в WEAP не является ежемесячной или не доступна для каждого месяца моделирования. Выход...

source: Saving as Excel with filename "{f}"
ru_ru: Сохранение в формате Excel с именем файла "{f}"

source: Could not save to Excel: {e}
ru_ru: Не удалось сохранить в Excel: {e}

source: Excel file "{f}" not written correctly: file does not exist. Will use existing expression.
ru_ru: Excel файл "{f}" записан неправильно: файл не существует. Будет использовано существующее выражение.

source: Assigning to LEAP hydropower plant: {h}
ru_ru: Присвоение гидроэлектростанции LEAP: {h}

source: Moving water pumping information from WEAP to LEAP (iteration {i}), agricultural use
ru_ru: Перемещение информации о перекачке воды из WEAP в LEAP (итерация {i}), сельскохозяйственное использование

source: Moving water pumping information from WEAP to LEAP
ru_ru: Перемещение информации о перекачке воды из WEAP в LEAP

source: Scenario: {w} (WEAP)/{l} (LEAP)
ru_ru: Сценарий: {w} (WEAP)/{l} (LEAP)

source: Moving industrial water requirements from WEAP to LEAP
ru_ru: Перемещение требований к промышленной воде из WEAP в LEAP

source: Moving water pumping information from WEAP to LEAP (iteration {i}), industrial and domestic use
ru_ru: Перемещение информации о перекачке воды из WEAP в LEAP (итерация {i}), промышленное и бытовое использование

source: Calculating LEAP area (iteration {i})
ru_ru: Вычисление площади LEAP (итерация {i})

source: Saving LEAP and WEAP areas
ru_ru: Сохранение областей LEAP и WEAP

source: Saving versions for iteration {i}
ru_ru: Сохранение версий для итерации {i}

source: Iteration {i}
ru_ru: Итерация {i}

source: Recording results and checking for convergence (iteration {i})
ru_ru: Запись результатов и проверка сходимости (итерация {i})

source: Checking results for scenario: {w} (WEAP)/{l} (LEAP)
ru_ru: Результаты проверки для сценария: {w} (WEAP)/{l} (LEAP)

source: Checking LEAP results...
ru_ru: Проверка результатов LEAP...

source: LEAP did not return a value for "{e}" in year {y} of scenario {s}
ru_ru: LEAP не вернул значение для "{e}" в год {y} сценария {s}

source: Checking Macro results...
ru_ru: Проверка результатов макросъемки...

source: LEAP did not return a value for Macro result "{e}" in year {y} of scenario {s} for {r}
ru_ru: LEAP не вернул значение для макрорезультата "{e}" в год {y} сценария {s} для {r}

source: Checking WEAP results...
ru_ru: Проверка результатов WEAP...

source: WEAP did not return a value for "{e}" in year {y} of scenario {s}
ru_ru: WEAP не вернул значение для "{e}" в год {y} сценария {s}

source: Checking whether calculations converged...
ru_ru: Проверка сходимости расчетов...

source: Checking convergence for scenario: {w} (WEAP)/{l} (LEAP)
ru_ru: Проверка сходимости для сценария: {w} (WEAP)/{l} (LEAP)

source: Difference exceeded tolerance for LEAP result "{e}" in year {y}: previous value = {p}, current value = {c}
ru_ru: Разница превысила допуск для результата LEAP "{e}" в году {y}: предыдущее значение = {p}, текущее значение = {c}

source: Difference exceeded tolerance for LEAP-Macro result "{e}" in year {y} for region {r}: previous value = {p}, current value = {c}
ru_ru: Разница превысила допустимое значение для результата LEAP-Macro "{e}" в год {y} для региона {r}: предыдущее значение = {p}, текущее значение = {c}

source: Difference exceeded tolerance for WEAP result "{e}" in year {y}: previous value = {p}, current value = {c}
ru_ru: Разница превысила допуск для результата WEAP "{e}" в год {y}: предыдущее значение = {p}, текущее значение = {c}

source: All target WEAP and LEAP results converged to within the specified tolerance ({t}%). No additional iterations of WEAP and LEAP calculations are needed for this scenario.
ru_ru: Все целевые результаты WEAP и LEAP сошлись в пределах заданного допуска ({t}%). Для этого сценария не требуется дополнительных итераций расчетов WEAP и LEAP.

source: Results did not converge for this scenario.
ru_ru: Результаты не сошлись для этого сценария.

source: All target WEAP and LEAP results converged to within the specified tolerance ({t}%) for all scenarios.
ru_ru: Все целевые результаты WEAP и LEAP сошлись в пределах заданного допуска ({t}%) для всех сценариев.

source: Results have not converged in at least one scenario. Iterating...
ru_ru: Результаты не сошлись по крайней мере в одном сценарии. Итерация...

source: Reached maximum number of iterations {m} without converging within tolerance {t}% for at least one scenario
ru_ru: Достигнуто максимальное число итераций {m} без сходимости в пределах допуска {t}% f или хотя бы в одном сценарии

source: Pushing WEAP results to Macro...
ru_ru: Передача результатов WEAP в макрос...

source: Processing for WEAP scenario: {s}
ru_ru: Обработка для сценария WEAP: {s}

source: Completed WEAP-LEAP integration procedure
ru_ru: Завершение процедуры интеграции WEAP-LEAP

source: Total elapsed time: {t}
ru_ru: Общее прошедшее время: {t}
